import random
import time


def random_happy_emote() -> str:
    random.seed(time.time())
    return random.choice(
        [
            "▼・ᴥ・▼",
            "U・ᴥ・U",
            "(U・x・U)",
            "U ´ᴥ` U",
            "=^._.^=",
            "（＾・ω・＾❁）",
            "(=‐ω‐=)",
            "(=^･ｪ･^=))ﾉ彡☆",
            "(^・x・^)",
            "/ᐠ｡ꞈ｡ᐟ\\",
            "/ᐠ｡▿｡ᐟ\\*ᵖᵘʳʳ*",
            "/ᐠ_ ꞈ _ᐟ\\ɴʏᴀ~",
            "ʕ •ᴥ•ʔ",
            ">:3",
            "xD" ":3" "♥w♥",
            "UwU",
            "OwO",
            "ÕwÕ",
            "ÓwÓ",
            "(。O ω O。)",
            "(。O⁄ ⁄ω⁄ ⁄ O。)",
            "(◕‿◕✿)" "( °ω° )",
            "(ʘωʘ)",
            "♥(。ᅌ ω ᅌ。)" "☆w☆",
        ]
    )


def random_bad_emote() -> str:
    random.seed(time.time())
    return random.choice(
        [
            "υ´• ﻌ •`υ",
            "ʕ； •`ᴥ•´ʔ",
            "⊂(￣(ｴ)￣)⊃",
            "( ˘•̥ _•̥ ˘ )",
            "(´；ω；`)",
            "(´；д；`)",
            "(　；∀；)",
            "（┬┬＿┬┬）",
            "(´•̥ ᵔ •̥`)*ᶜʳᶦᵉˢ*",
            "_|￣|○",
            ":c",
            "¯\_(⌣̯̀ ⌣́)_/¯",
        ]
    )
